# DuctFittingAndAccessoryPressureDropService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..DuctFittingAndAccessoryPressureDropService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId DuctFittingAndAccessoryPressureDropService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctFittingAndAccessoryPressureDropService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ DuctFittingAndAccessoryPressureDropService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace